[
  {
    "id": 1,
    "text": "موضوع یا پدیده اصلی را که می‌خواهید بررسی کنید، به‌طور خلاصه شرح دهید.",
    "type": "text"
  },
  {
    "id": 2,
    "text": "چه مشکل، شکاف دانش، یا سؤال خاصی را می‌خواهید با پژوهش خود مورد بررسی قرار دهید؟",
    "type": "text"
  },
  {
    "id": 3,
    "text": "اهداف اصلی پژوهش شما چیست؟ امیدوارید به چه چیزی دست یابید یا چه چیزی را کشف کنید؟",
    "type": "text"
  },
  {
    "id": 4,
    "text": "رویکرد اصلی پژوهش شما کدام است؟",
    "type": "single",
    "options": [
      "اندازه‌گیری عددی، آزمون فرضیه، یا برقراری روابط آماری (رویکرد کمی)",
      "درک تجربیات، دیدگاه‌ها، معانی، یا کاوش عمیق یک موضوع (رویکرد کیفی)",
      "ترکیبی از هر دو رویکرد (کمی و کیفی)",
      "مطمئن نیستم / نیاز به راهنمایی بیشتر دارم"
    ]
  },
  {
    "id": 5,
    "text": "چه نوع داده‌ای را برای جمع‌آوری در نظر دارید؟ (می‌توانید چند گزینه را انتخاب کنید)",
    "type": "multiple",
    "options": [
      "اعداد از نظرسنجی‌ها، پرسشنامه‌ها یا آزمایش‌ها (داده‌های کمی)",
      "متن از مصاحبه‌های فردی یا گروهی، گروه‌های کانونی، یا پاسخ‌های تشریحی (داده‌های کیفی)",
      "داده‌های حاصل از مشاهده (مانند یادداشت‌های میدانی، ضبط ویدئویی یا صوتی)",
      "اسناد و مدارک موجود (مانند متون آرشیوی، گزارش‌ها، مقالات علمی، تصاویر، داده‌های عمومی)",
      "سایر موارد (لطفاً در صورت انتخاب، توضیح دهید)"
    ]
  },
  {
    "id": 6,
    "text": "آیا متغیرها یا مفاهیم از پیش تعریف‌شده‌ای دارید که می‌خواهید اندازه‌گیری کنید، یا انتظار دارید مفاهیم و مضامین اصلی از دل داده‌ها پدیدار شوند؟",
    "type": "single",
    "options": [
      "بله، متغیرها یا مفاهیم مشخصی برای اندازه‌گیری و آزمون دارم (رویکرد عمدتاً استنتاجی/قیاسی).",
      "خیر، انتظار دارم مفاهیم و مضامین اصلی در طی فرآیند تحلیل داده‌ها شناسایی شوند (رویکرد عمدتاً استقرایی).",
      "ترکیبی از هر دو؛ برخی مفاهیم مشخص هستند و برخی دیگر ممکن است پدیدار شوند.",
      "مطمئن نیستم."
    ]
  },
  {
    "id": 7,
    "text": "سؤال (یا سؤالات) اصلی پژوهش شما که به دنبال پاسخ به آن هستید، چیست؟ لطفاً به طور واضح بیان کنید.",
    "type": "text"
  },
  {
    "id": 8,
    "text": "کدام یک از اهداف پژوهشی زیر با پژوهش شما بیشترین همخوانی را دارد؟ (در صورت لزوم، نزدیک‌ترین گزینه را انتخاب کنید)",
    "type": "single",
    "options": [
      "توصیف دقیق ویژگی‌ها، فراوانی یا روند یک پدیده، گروه یا موقعیت.",
      "کاوش عمیق یک پدیده کمتر شناخته‌شده برای تولید ایده‌ها، فرضیه‌های اولیه یا درک بهتر آن.",
      "توضیح و آزمون روابط علت و معلولی بین دو یا چند متغیر.",
      "مقایسه تفاوت‌ها یا شباهت‌ها بین دو یا چند گروه، زمینه یا پدیده.",
      "بررسی و اندازه‌گیری میزان رابطه یا همبستگی بین دو یا چند متغیر.",
      "ارزیابی اثربخشی، کارایی یا پیامدهای یک مداخله، برنامه، سیاست یا محصول.",
      "شناسایی، تحلیل و حل یک مشکل عملی خاص در یک زمینه مشخص از طریق یک فرآیند چرخه‌ای (مانند اقدام‌پژوهی).",
      "توسعه یا اعتبارسنجی یک ابزار اندازه‌گیری جدید (مانند پرسشنامه).",
      "هیچکدام از موارد فوق به طور کامل مطابقت ندارد / نیاز به توضیح بیشتر."
    ]
  },
  {
    "id": 9,
    "text": "آیا برای پژوهش خود از داده‌های موجود (ثانویه) استفاده خواهید کرد، یا داده‌های جدید (اولیه) جمع‌آوری می‌کنید، یا ترکیبی از هر دو؟",
    "type": "single",
    "options": [
      "عمدتاً از داده‌های موجود که قبلاً توسط دیگران جمع‌آوری شده استفاده خواهم کرد (تحقیق ثانویه).",
      "عمدتاً داده‌های جدید و دست اول را خودم جمع‌آوری خواهم کرد (تحقیق اولیه).",
      "ترکیبی از داده‌های اولیه و ثانویه را به کار خواهم گرفت.",
      "هنوز تصمیم نگرفته‌ام / مطمئن نیستم."
    ]
  },
  {
    "id": 10,
    "text": "آیا محدودیت‌های عملی مهمی مانند محدودیت زمانی، بودجه ناکافی، یا دشواری در دسترسی به شرکت‌کنندگان/داده‌ها وجود دارد که ممکن است بر انتخاب روش تحقیق شما تأثیر بگذارد؟ لطفاً توضیح دهید.",
    "type": "text"
  },
  {
    "id": 11,
    "text": "آیا ملاحظات اخلاقی خاصی در پژوهش شما وجود دارد که باید در نظر گرفته شود (مانند کار با گروه‌های آسیب‌پذیر، جمع‌آوری داده‌های حساس شخصی، نیاز به کسب رضایت آگاهانه، حفظ حریم خصوصی و محرمانگی داده‌ها)؟ لطفاً به طور خلاصه توضیح دهید.",
    "type": "text"
  }
]