[
  {
    "id": 1,
    "text": "موضوع یا پدیده اصلی را که می‌خواهید بررسی کنید، به‌طور خلاصه شرح دهید.",
    "type": "text",
    "explain": "این سؤال به درک هسته اصلی پژوهش کمک می‌کند. شفاف‌سازی موضوع، نقطه شروعی برای تعیین دامنه تحقیق و جستجوی ادبیات پژوهش است. مدل‌های LLM می‌توانند بر اساس این شرح، کلیدواژه‌های اولیه، پژوهشگران مرتبط و مقالات پایه‌ای را پیشنهاد دهند."
  },
  {
    "id": 2,
    "text": "چه مشکل، شکاف دانش، یا سؤال خاصی را می‌خواهید با پژوهش خود مورد بررسی قرار دهید؟",
    "type": "text",
    "explain": "پاسخ به این سؤال، ضرورت و اهمیت تحقیق شما را مشخص می‌کند. شناسایی دقیق شکاف دانشی که قصد پر کردن آن را دارید، به تدوین سؤالات تحقیق دقیق‌تر کمک می‌کند. LLM می‌تواند در تحلیل ادبیات پژوهش برای یافتن شکاف‌های کمتر دیده‌شده و فرموله‌کردن مسئله تحقیق یاری‌رسان باشد."
  },
  {
    "id": 3,
    "text": "اهداف اصلی پژوهش شما چیست؟ امیدوارید به چه چیزی دست یابید یا چه چیزی را کشف کنید؟",
    "type": "text",
    "explain": "اهداف، مسیر تحقیق را تعیین کرده و معیاری برای سنجش موفقیت آن فراهم می‌کنند. آیا هدف، توصیف یک پدیده، تبیین یک رابطه، یا ارزیابی یک مداخله است؟ پاسخ به این سؤال مستقیماً بر انتخاب روش تحقیق (مثلاً توصیفی، همبستگی، یا آزمایشی) تأثیر می‌گذارد."
  },
  {
    "id": 4,
    "text": "رویکرد اصلی پژوهش شما کدام است؟",
    "type": "single",
    "options": [
      "اندازه‌گیری عددی، آزمون فرضیه، یا برقراری روابط آماری (رویکرد کمی)",
      "درک تجربیات، دیدگاه‌ها، معانی، یا کاوش عمیق یک موضوع (رویکرد کیفی)",
      "ترکیبی از هر دو رویکرد (کمی و کیفی)",
      "مطمئن نیستم / نیاز به راهنمایی بیشتر دارم"
    ],
    "explain": "این یکی از اساسی‌ترین تصمیم‌هاست. رویکرد کمی با اعداد و آمار سروکار دارد و برای آزمون فرضیه‌ها مناسب است. رویکرد کیفی بر درک عمیق پدیده‌ها از طریق داده‌های متنی و روایی متمرکز است. این انتخاب، نوع داده، ابزار جمع‌آوری و روش تحلیل را به‌طور کامل مشخص می‌کند. LLMها هم در تحلیل داده‌های متنی (کیفی) و هم در تولید کد برای تحلیل آماری (کمی) کاربرد دارند."
  },
  {
    "id": 5,
    "text": "چه نوع داده‌ای را برای جمع‌آوری در نظر دارید؟ (می‌توانید چند گزینه را انتخاب کنید)",
    "type": "multiple",
    "options": [
      "اعداد از نظرسنجی‌ها، پرسشنامه‌ها یا آزمایش‌ها (داده‌های کمی)",
      "متن از مصاحبه‌های فردی یا گروهی، گروه‌های کانونی، یا پاسخ‌های تشریحی (داده‌های کیفی)",
      "داده‌های حاصل از مشاهده (مانند یادداشت‌های میدانی، ضبط ویدئویی یا صوتی)",
      "اسناد و مدارک موجود (مانند متون آرشیوی، گزارش‌ها، مقالات علمی، تصاویر، داده‌های عمومی)",
      "سایر موارد (لطفاً در صورت انتخاب، توضیح دهید)"
    ],
    "explain": "نوع داده مستقیماً به رویکرد شما (سؤال ۴) وابسته است و بر روش تحلیل تأثیر می‌گذارد. تحلیل داده‌های عددی نیازمند روش‌های آماری است، درحالی‌که تحلیل داده‌های متنی به روش‌هایی مانند تحلیل محتوا یا تحلیل تماتیک نیاز دارد. LLMها به‌طور خاص در کار با داده‌های متنی حجیم (گزینه ۲ و ۴) بسیار قدرتمند هستند."
  },
  {
    "id": 6,
    "text": "آیا متغیرها یا مفاهیم از پیش تعریف‌شده‌ای دارید که می‌خواهید اندازه‌گیری کنید، یا انتظار دارید مفاهیم و مضامین اصلی از دل داده‌ها پدیدار شوند؟",
    "type": "single",
    "options": [
      "بله، متغیرها یا مفاهیم مشخصی برای اندازه‌گیری و آزمون دارم (رویکرد عمدتاً استنتاجی/قیاسی).",
      "خیر، انتظار دارم مفاهیم و مضامین اصلی در طی فرآیند تحلیل داده‌ها شناسایی شوند (رویکرد عمدتاً استقرایی).",
      "ترکیبی از هر دو؛ برخی مفاهیم مشخص هستند و برخی دیگر ممکن است پدیدار شوند.",
      "مطمئن نیستم."
    ],
    "explain": "این سؤال منطق تحقیق شما را مشخص می‌کند. رویکرد قیاسی (Deductive) از تئوری شروع کرده و به آزمون آن می‌پردازد (مناسب تحقیقات کمی). رویکرد استقرایی (Inductive) از داده‌ها شروع کرده و به سمت نظریه حرکت می‌کند (مناسب تحقیقات کیفی). LLMها می‌توانند در رویکرد استقرایی با شناسایی الگوها و مضامین نوظهور در داده‌های متنی بسیار مفید باشند."
  },
  {
    "id": 7,
    "text": "سؤال (یا سؤالات) اصلی پژوهش شما که به دنبال پاسخ به آن هستید، چیست؟ لطفاً به طور واضح بیان کنید.",
    "type": "text",
    "explain": "سؤال تحقیق، ستون فقرات پژوهش است. یک سؤال خوب، مشخص، قابل تحقیق و متمرکز است. تمام مراحل بعدی، از جمله انتخاب روش، در خدمت پاسخ به این سؤال خواهد بود. می‌توانید از LLM برای پالایش و دقیق‌تر کردن سؤالات تحقیق خود بر اساس اهداف و شکاف دانش شناسایی‌شده استفاده کنید."
  },
  {
    "id": 8,
    "text": "کدام یک از اهداف پژوهشی زیر با پژوهش شما بیشترین همخوانی را دارد؟ (در صورت لزوم، نزدیک‌ترین گزینه را انتخاب کنید)",
    "type": "single",
    "options": [
      "توصیف دقیق ویژگی‌ها، فراوانی یا روند یک پدیده، گروه یا موقعیت.",
      "کاوش عمیق یک پدیده کمتر شناخته‌شده برای تولید ایده‌ها، فرضیه‌های اولیه یا درک بهتر آن.",
      "توضیح و آزمون روابط علت و معلولی بین دو یا چند متغیر.",
      "مقایسه تفاوت‌ها یا شباهت‌ها بین دو یا چند گروه، زمینه یا پدیده.",
      "بررسی و اندازه‌گیری میزان رابطه یا همبستگی بین دو یا چند متغیر.",
      "ارزیابی اثربخشی، کارایی یا پیامدهای یک مداخله، برنامه، سیاست یا محصول.",
      "شناسایی، تحلیل و حل یک مشکل عملی خاص در یک زمینه مشخص از طریق یک فرآیند چرخه‌ای (مانند اقدام‌پژوهی).",
      "توسعه یا اعتبارسنجی یک ابزار اندازه‌گیری جدید (مانند پرسشنامه).",
      "هیچکدام از موارد فوق به طور کامل مطابقت ندارد / نیاز به توضیح بیشتر."
    ],
    "explain": "این سؤال به شناسایی دقیق نوع تحقیق کمک می‌کند. هر یک از این گزینه‌ها به یک یا چند روش تحقیق خاص اشاره دارد. برای مثال، هدف 'توضیحی' به سمت طرح‌های آزمایشی یا رگرسیونی گرایش دارد، درحالی‌که هدف 'کاوشی' به سمت مطالعات کیفی مانند مطالعه موردی یا نظریه داده‌بنیاد اشاره می‌کند."
  },
  {
    "id": 9,
    "text": "آیا برای پژوهش خود از داده‌های موجود (ثانویه) استفاده خواهید کرد، یا داده‌های جدید (اولیه) جمع‌آوری می‌کنید، یا ترکیبی از هر دو؟",
    "type": "single",
    "options": [
      "عمدتاً از داده‌های موجود که قبلاً توسط دیگران جمع‌آوری شده استفاده خواهم کرد (تحقیق ثانویه).",
      "عمدتاً داده‌های جدید و دست اول را خودم جمع‌آوری خواهم کرد (تحقیق اولیه).",
      "ترکیبی از داده‌های اولیه و ثانویه را به کار خواهم گرفت.",
      "هنوز تصمیم نگرفته‌ام / مطمئن نیستم."
    ],
    "explain": "این تصمیم بر منابع، زمان و فرآیند تحقیق تأثیرگذار است. تحقیقات اولیه کنترل بیشتری بر کیفیت داده‌ها فراهم می‌کنند اما زمان‌بر و پرهزینه‌تر هستند. تحقیقات ثانویه سریع‌تر هستند اما ممکن است داده‌ها کاملاً با سؤال تحقیق شما منطبق نباشند. LLMها می‌توانند در تحلیل مجموعه داده‌های بزرگ ثانویه (متنی یا عددی) بسیار کارآمد عمل کنند."
  },
  {
    "id": 10,
    "text": "آیا محدودیت‌های عملی مهمی مانند محدودیت زمانی، بودجه ناکافی، یا دشواری در دسترسی به شرکت‌کنندگان/داده‌ها وجود دارد که ممکن است بر انتخاب روش تحقیق شما تأثیر بگذارد؟ لطفاً توضیح دهید.",
    "type": "text",
    "explain": "روش تحقیق باید واقع‌بینانه و قابل اجرا باشد. محدودیت‌های عملی می‌توانند شما را به سمت روش‌های خاصی سوق دهند. برای مثال، اگر دسترسی به شرکت‌کنندگان دشوار باشد، شاید تحلیل داده‌های آنلاین یا اسناد موجود (با کمک LLM) گزینه بهتری نسبت به مصاحبه‌های حضوری باشد."
  },
  {
    "id": 11,
    "text": "آیا ملاحظات اخلاقی خاصی در پژوهش شما وجود دارد (مانند کار با گروه‌های آسیب‌پذیر، جمع‌آوری داده‌های حساس شخصی، نیاز به کسب رضایت آگاهانه، حفظ حریم خصوصی و محرمانگی داده‌ها)؟ لطفاً به طور خلاصه توضیح دهید.",
    "type": "text",
    "explain": "اخلاق در پژوهش یک اصل بنیادین است. پاسخ به این سؤال به طراحی پروتکل‌هایی برای حفاظت از شرکت‌کنندگان و داده‌ها کمک می‌کند. هنگام استفاده از LLMها، مسائل اخلاقی جدیدی مانند حریم خصوصی داده‌ها (عدم بارگذاری اطلاعات حساس در پلتفرم‌های عمومی) و سوگیری‌های الگوریتمی مطرح می‌شود که باید به دقت مدیریت شوند."
  }
]